{
  "opening": {
    "title": "Invocation d'ouverture",
    "subtitle": "À réciter avant la lecture des sourates",
    "arabic": "أَسْتَغْفِرُ اللهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ غَفَّارُ الذُّنُوبِ ذُو الجَلَالِ وَالْإِكْرَامِ، وَأَتُوبُ إِلَيْهِ مِنْ جَمِيعِ الْمَعَاصِي كُلْهَا وَالذُّنُوبِ وَالْآثَامِ وَمِنْ كُلِّ ذَنْبٍ أَذْنَبْتُهُ عَمْداً وَخَطَأَ ظَاهِراً وَبَاطِنَا قَوْلاً وَفِعْلاً فِي جَمِيعِ حَرَكَاتِي وَسَكَنَاتِي وَخَطَرَاتِي وَأَنْفَاسِي كُلِّهَا دَائِماً أَبَداً سَرْمَداً مِنَ الذَّنْبِ الَّذِي أَعْلَم وَمِنَ الذَّنْبِ الَّذِي لَا أَعْلَمُ عَدَدَ مَا أَحَاطَ بِهِ الْعِلْمُ وَأَحْصَاهُ الْكِتَابُ وَخَطْهُ الْقَلَمُ وَعَدَدَ مَا أَوْجَدَتْهُ الْقُدْرَةُ وَخَصَّصَتْهُ الْإِرَادَةُ وَمِدَادَ كَلِمَاتِ اللَّهِ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِ رَبِّنَا وَجَمَالِهِ وَكَمَالِهِ وَكَمَا يُحِبُّ رَبُّنَا وَيَرْضَى",
    "transliteration": "Astaghfiru Allah al-'Azim alladhi la ilaha illa huwa al-Hayyu al-Qayyum ghaffar adh-dhunub dhu al-jalal wa al-ikram, wa atubu ilayhi min jami' al-ma'asi kulliha wa adh-dhunub wa al-atham wa min kulli dhanbin adhnabtuh 'amdan wa khata'an zahiran wa batinan qawlan wa fi'lan fi jami' harakati wa sakanati wa khatirati wa anfasi kulliha da'iman abadan sarmadan min adh-dhanb alladhi a'lam wa min adh-dhanb alladhi la a'lam 'adad ma ahata bihi al-'ilm wa ahsahu al-kitab wa khattahu al-qalam wa 'adad ma awjadath al-qudra wa khassasath al-irada wa midada kalimat Allah kama yanbaghhi li-jalal wajhi rabbina wa jamalihi wa kamalihi wa kama yuhibbu rabbuna wa yarda",
    "french": "Je demande pardon à Allah le Très Grand, Celui en dehors duquel il n'y a point de divinité digne d'adoration, le Vivant, Celui qui subsiste par Lui-même, Celui qui pardonne les péchés, Détenteur de la Majesté et de la Générosité, et je me repens à Lui de tous les péchés, toutes les désobéissances et tous les crimes, de tout péché que j'ai commis volontairement ou par erreur, apparemment ou secrètement, en parole et en acte, dans tous mes mouvements et mes repos, mes pensées et mes respirations, constamment et éternellement, du péché que je connais et du péché que je ne connais pas, selon le nombre de ce que la science englobe, que le Livre dénombre et que la Plume a écrit, selon le nombre de ce que la Puissance a créé et que la Volonté a spécifié, et selon l'encre des Paroles d'Allah, comme il convient à la Majesté de la Face de notre Seigneur, à Sa Beauté et à Sa Perfection, et comme notre Seigneur aime et agrée."
  },
  "closing": {
    "title": "Invocation de clôture",
    "subtitle": "À réciter après la lecture des sourates",
    "arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَصَلِّ عَلَيْهِ رَبَّنَا وَعَلَى آلِهِ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ وَهَدَيْتَهُمُ الصِّرَاطَ الْمُسْتَقِيمَ",
    "transliteration": "Bismillah ar-Rahman ar-Rahim. Al-hamdu lillahi rabbi al-'alamin wa salli 'alayhi rabbana wa 'ala alihi alladhina an'amta 'alayhim wa hadaytahum as-sirat al-mustaqim",
    "french": "Au nom d'Allah, le Tout Miséricordieux, le Très Miséricordieux. Louange à Allah, Seigneur de l'univers. Et prie sur lui, notre Seigneur, ainsi que sur sa famille, ceux que Tu as comblés de bienfaits et que Tu as guidés sur le droit chemin."
  }
}